import numpy as np

#----------------------------CHESSBOARD-------------------------------------------
class ChessBoard():
    def __init__(self):
        """
        двумерный массив шахматной доски
        """
        self.array = np.array([[0,0,0,0,0,0,0,0], 
                               [0,0,0,0,0,0,0,0],
                               [0,0,0,0,0,0,0,0],
                               [0,0,0,0,0,0,0,0],
                               [0,0,0,0,0,0,0,0],
                               [0,0,0,0,0,0,0,0],
                               [0,0,0,0,0,0,0,0],
                               [0,0,0,0,0,0,0,0]], dtype=object)


board = ChessBoard()